{"data":{"post":{"id":"c7574981-17e0-5607-9eb6-04e85b87f4e2","html":"<h3>Limits? In serverless?</h3>\n<p>If you travel to pages like the <a href=\"https://docs.microsoft.com/en-us/azure/azure-functions/functions-scale#understanding-scaling-behaviors\">scale and hosting</a>, you may, rightly, be under the impression that azure functions can scale pretty massively.  (At time of writing) 200 instances?  Multi-messages per instance? I can do 1000 things at once!</p>\n<p>While this is technically true, you better be doing 1000 Hello World’s, because Azure Functions running on the consumption model reside in the <a href=\"https://github.com/projectkudu/kudu/wiki/Azure-Web-App-sandbox#per-sandbox-per-appper-site-numerical-limits\">Azure Sandbox</a>.  You will note that the documentation here is much more hidden, but there are some <a href=\"https://www.troyhunt.com/breaking-azure-functions-with-too-many-connections/\">other bloggers</a> who have hit limits as well. The Azure Sandbox is where Free and Shared App Services run, and also consumption functions. Because of this grouping, the limits are smaller than you might think when reading Azure marketing jargon. This is not an Azure-specific issue, as AWS has similar limits (although a bit easier to find).</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/27bdb4a9cb306c53353570350f433baa/05d04/limitstable.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 738px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 67.07317073170731%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAQAF/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEAMQAAAB3USmP//EABQQAQAAAAAAAAAAAAAAAAAAACD/2gAIAQEAAQUCX//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABQQAQAAAAAAAAAAAAAAAAAAACD/2gAIAQEABj8CX//EABgQAAMBAQAAAAAAAAAAAAAAAAEQEQAh/9oACAEBAAE/IeIGhzf/2gAMAwEAAgADAAAAEBMP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAGhABAAMBAQEAAAAAAAAAAAAAAQARITFRgf/aAAgBAQABPxChOcc+wrJWDfsDHYAMn//Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px transparent;\"\n        alt=\"Limits Table\"\n        title=\"\"\n        src=\"/static/27bdb4a9cb306c53353570350f433baa/05d04/limitstable.jpg\"\n        srcset=\"/static/27bdb4a9cb306c53353570350f433baa/f03e8/limitstable.jpg 200w,\n/static/27bdb4a9cb306c53353570350f433baa/0532f/limitstable.jpg 400w,\n/static/27bdb4a9cb306c53353570350f433baa/05d04/limitstable.jpg 738w\"\n        sizes=\"(max-width: 738px) 100vw, 738px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>There are 5 limits, but really only 2 to worry about, as you are likely to hit them before others: Connections and Threads. The connections limit is in the process of being lifted to 600, and all of my apps appear to be operating with the higher limit, but you may still be experiencing the lower limit at time of writing. Before the connection limit change, I never hit the thread limit. After the change, I have never hit the connection limit, only threads.</p>\n<h3>What Happens When a Limit is hit?</h3>\n<p>First off, the Azure functions host itself reserves some of the limit for itself. This makes sense so that the whole system doesn’t go down, but you should realize that your actualy limit will be 250 connections or 400 threads.</p>\n<p>Ideally, the function host shuts down, it realizes what happened, and it boots back up in a few seconds. No harm done, and you probably didn’t even notice unless you have a health monitor.</p>\n<p>In practice, this happens about 25% of the time, and the other 75% generates an outage that can last up to several hours, with no warning (unless you yourself create one). If you visit a function during this time, you will get the response “The function host is not running”. If you visit the portal during this time, you will get the feared red box informing you Host Thresholds Exceeded: [Threads]. Typically, you will need to restart to resolve this.</p>\n<h3>How to Overcome</h3>\n<h4>Connection-Specific</h4>\n<p>There are some general design principles to follow when writing in C# that may not be altogether obvious from the way the interfaces are written. <a href=\"https://docs.microsoft.com/en-us/azure/azure-functions/manage-connections\">Azure documentation itself</a> actually has some great guidance here, and they go into lots of detail, but I will quickly touch on here:</p>\n<ul>\n<li>Static Clients: Create one static HttpClient (and Azure Storage Clients) on instance-load and use it for every call. This is not totally obvious, given the fact that HttpClient is disposable, so it is tempting to use it in a using statement. <a href=\"https://docs.microsoft.com/en-us/azure/architecture/antipatterns/improper-instantiation/\">DO NOT DO THIS</a>.</li>\n<li>Pooled connections for Sql/Entity Framework: This is commonplace in the connection string, and is the default functionality, so it is much less common to run into issues.</li>\n</ul>\n<h4>General Design Principles</h4>\n<p>Over the course of using consumption functions frequently over the past few years, here are some general design principles I follow to avoid problems, some more obvious than others:</p>\n<ul>\n<li>Fail your functions quickly: While it may be tempting to have a long timeout and allow the function to retry many times, I have generally found it better to just fail and have it retry the pattern later. This saves on cost, but also causes less resources to be in use at any given time.</li>\n<li>CreateIfNotExists: This keyword should be familiar to anyone who has used the AzureStorage SDK. A lot of Azure’s examples use this method very frequently as well as a failsafe, but be careful not to use it in a loop, especially an async one, as it creates another call to the storage account in each loop (it has no memory that it just called this a moment ago).</li>\n<li>Be careful of Queue functions: While convenient, and extremely powerful, nothing can bust through these limits like an Azure Storage or Service Bus Queue triggered function. The default behavior is to grab up to 32 messages at once for concurrent processing PER INSTANCE.  This is great for getting a lot accomplished in a very short time, but not so great when you have 15 instances running and can only do 400 things at once (15 * 32 = 480). If you have something that controls how quickly the queue is loaded, you are probably fine with the default functionality. I do not recommend using the InitialVisibility to achieve this, however, as it tends to create more problems than it fixes (initial visibility of a week and such). More typically, you can <a href=\"https://docs.microsoft.com/en-us/azure/azure-functions/functions-bindings-storage-queue#host-json\">change the default behavior in the appropriate section of host.json</a> to something more manageable. In extreme cases, or in cases where you are up against an API request limit, use a timer function that runs frequently and pulls a set number of queue messages manually.</li>\n<li>Horizontally scale, in a different way: Do not be afraid to create a whole bunch of function apps. If they don’t do anything, they are free, and setting them up is a fairly painless process using the resource explorer to set application settings using JSON. Do not be afraid to have a function app with only one function, separate the concerns down to a miniscule level, it is far better to have a nearly idle function app then to hit the limits. For queue or timer functions, make sure they are unique to a function app, as only one app will create a singleton lock on the queue or timer. For Http functions (API/Website), don’t be afraid to split them up and use a traffic manager. Even with the additional cost, <a href=\"/azure-functions-consumption-vs-app-service-vs-kubernetes\">you are still likely going to find it cheaper than using a different hosted option</a>.</li>\n<li>Segment Durable Functions into their own function app: These functions are particularly chatty with Azure Storage, and you want to keep them from clogging up your non-durable counterparts.</li>\n</ul>\n<p>In general, Azure Functions are very scalable, once you have a few tools under your belt to help it actually have a smooth experience while scaling.</p>","fields":{"slug":"/azure-function-limits-how-to-overcome/","prefix":"2019-02-27"},"frontmatter":{"title":"Consumption Azure Functions Limits & How to Overcome them","author":"Derek Kershner","category":"Azure Functions","cover":{"childImageSharp":{"resize":{"src":"/static/a811f5af8e19b59d1b86e9d4f5231b97/c8002/gate.jpg"}}}}},"authornote":{"id":"3025ae0b-46e9-5881-aee4-12170e6ddfae","html":"<p><strong>Derek Kershner</strong> Coming from being a Data Analyst, and becoming a .NET Developer, Kubernetes Architect, and Azure Cloud Consultant, a unique perspective is born, and this is him writing about what he figures out along the way.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/azure-function-limits-how-to-overcome/","prev":{"id":"bb09f7f9-e183-5e6d-89b5-0a67d417a1cc","fields":{"slug":"/azure-functions-consumption-vs-app-service-vs-kubernetes/","prefix":"2019-02-26","source":"posts"},"frontmatter":{"title":"Azure Functions v2 Consumption vs App Service Plan vs Kubernetes - Where to Host for optimal cost and performance?","category":"Azure Functions"}},"source":"posts"}}